#### BuiltInFailures.FilledRegionFailures Members

---

|  |
| --- |
| BuiltInFailures FilledRegionFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures FilledRegionFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | BadViewType | [Filled Region Name] can't be placed in 3D Views. |
| Public property Static member | CannotDrawFilledRegion | Can't draw [Filled Region Name]. |
| Public property Static member | CannotDrawFilledRegionError | Can't draw [Filled Region Name]. |

# See Also

BuiltInFailures FilledRegionFailures Class

Autodesk.Revit.DB Namespace